In [35]:
import pandas as pd

In [36]:
df = pd.read_csv("Fraud_check.csv")
df

,Undergrad,Marital.Status,Taxable.Income,City.Population,Work.Experience,Urban
0,NO,Single,68833,50047,10,YES
1,YES,Divorced,33700,134075,18,YES
2,NO,Married,36925,160205,30,YES
3,YES,Single,50190,193264,15,YES
4,NO,Married,81002,27533,28,NO
...,...,...,...,...,...,...
595,YES,Divorced,76340,39492,7,YES
596,YES,Divorced,69967,55369,2,YES
597,NO,Divorced,47334,154058,0,YES
598,YES,Married,98592,180083,17,NO
599,NO,Divorced,96519,158137,16,NO

In [37]:
df.shape

(600, 6)

In [38]:
df.isnull().sum()

Undergrad          0
Marital.Status     0
Taxable.Income     0
City.Population    0
Work.Experience    0
Urban              0
dtype: int64

In [39]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 600 entries, 0 to 599
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Undergrad        600 non-null    object
 1   Marital.Status   600 non-null    object
 2   Taxable.Income   600 non-null    int64
 3   City.Population  600 non-null    int64
 4   Work.Experience  600 non-null    int64
 5   Urban            600 non-null    object
dtypes: int64(3), object(3)
memory usage: 28.2+ KB

In [40]:
df.describe()

       Taxable.Income  City.Population  Work.Experience
count      600.000000       600.000000       600.000000
mean     55208.375000    108747.368333        15.558333
std      26204.827597     49850.075134         8.842147
min      10003.000000     25779.000000         0.000000
25%      32871.500000     66966.750000         8.000000
50%      55074.500000    106493.500000        15.000000
75%      78611.750000    150114.250000        24.000000
max      99619.000000    199778.000000        30.000000

In [41]:
df.duplicated().sum()

0

In [42]:
df.head()

,Undergrad,Marital.Status,Taxable.Income,City.Population,Work.Experience,Urban
0,NO,Single,68833,50047,10,YES
1,YES,Divorced,33700,134075,18,YES
2,NO,Married,36925,160205,30,YES
3,YES,Single,50190,193264,15,YES
4,NO,Married,81002,27533,28,NO

In [43]:
# label encoding
from sklearn.preprocessing import LabelEncoder
LE = LabelEncoder()

df["Undergrad"]=LE.fit_transform(df["Undergrad"])
df["Marital.Status"]=LE.fit_transform(df["Marital.Status"])
df["Urban"]=LE.fit_transform(df["Urban"])
df.head()

,Undergrad,Marital.Status,Taxable.Income,City.Population,Work.Experience,Urban
0,0,2,68833,50047,10,1
1,1,0,33700,134075,18,1
2,0,1,36925,160205,30,1
3,1,2,50190,193264,15,1
4,0,1,81002,27533,28,0

In [44]:
def f1(x):
    if x <= 30000:
        return 0
    else:
        return 1

In [45]:
df["Taxable.Income"] = df["Taxable.Income"].apply(f1)

In [49]:
df.head()

,Undergrad,Marital.Status,Taxable.Income,City.Population,Work.Experience,Urban
0,0,2,1,50047,10,1
1,1,0,1,134075,18,1
2,0,1,1,160205,30,1
3,1,2,1,193264,15,1
4,0,1,1,27533,28,0

In [47]:
df['Taxable.Income'].value_counts()

1    476
0    124
Name: Taxable.Income, dtype: int64

In [48]:
# splitting the variables into X and Y
Y = df['Taxable.Income']
X = df[['Undergrad','Marital.Status','City.Population','Work.Experience','Urban']]

In [50]:
# Data partision
from sklearn.model_selection import train_test_split
X_train,X_test,Y_train,Y_test = train_test_split(X,Y,test_size=0.30)
 
X_train.shape
X_test.shape
Y_train.shape
Y_test .shape

(180,)

In [56]:
# Model fitting
from sklearn.tree import DecisionTreeClassifier
classifier = DecisionTreeClassifier(criterion='gini',max_depth=12)
classifier.fit(X_train,Y_train)

DecisionTreeClassifier(max_depth=12)

In [57]:
Y_pred_train = classifier.predict(X_train)
Y_pred_test = classifier.predict(X_test)

In [58]:
from sklearn.metrics import accuracy_score
print("Training accuracy", accuracy_score(Y_train,Y_pred_train).round(3))
print("Testing accuracy", accuracy_score(Y_test,Y_pred_test).round(3))

Training accuracy 0.933
Testing accuracy 0.667

In [59]:
from sklearn.metrics import confusion_matrix
cm1 = confusion_matrix(Y_train, Y_pred_train)
cm1

array([[ 61,  24],
       [  4, 331]], dtype=int64)

In [60]:
cm2 = confusion_matrix(Y_test, Y_pred_test)
cm2

array([[  6,  33],
       [ 27, 114]], dtype=int64)

In [61]:
from sklearn import tree
import graphviz

dot_data = tree.export_graphviz(classifier,out_file=None, filled=True, rounded=True, special_characters=True)

graph = graphviz.source(dot_data)
graph

ModuleNotFoundError: No module named 'graphviz'